{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "1ddd06f7-3837-4ef9-8d70-cfe075736595",
   "metadata": {},
   "source": [
    "# IST769 Final Exam\n",
    "\n",
    "**INSTRUCTIONS FOR HIGHEST GRADE POSSIBLE**\n",
    "\n",
    "Unless you are explicitly instructed otherwise, answer each of the following using PySpark / Spark SQL. For any queries you write make sure to include a `printSchema()` and sample(s) of the output which clearly demonstrates the code is correct. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "25feebd0-d09b-4233-b9af-ec965875930c",
   "metadata": {},
   "outputs": [],
   "source": [
    "! sudo cp /home/jovyan/work/jars/neo4j-connector-apache-spark_2.12-4.1.0_for_spark_3.jar /usr/local/spark/jars/neo4j-connector-apache-spark_2.12-4.1.0_for_spark_3.jar"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "4308c98a-a418-4120-9ee7-05992d21e0fd",
   "metadata": {},
   "outputs": [],
   "source": [
    "!pip install -q cassandra-driver"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "5c73c8d6-8ab6-44a8-8a78-51598b8c07be",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pyspark\n",
    "from pyspark.sql import SparkSession"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "12353bca",
   "metadata": {},
   "outputs": [],
   "source": [
    "# YOUR NAME ========> Sravan Kumar Mangalagiri\n",
    "# YOUR SU EMAIL ====> smangala@syr.edu"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "91718b91-ceae-416d-b96c-053a5d844676",
   "metadata": {},
   "source": [
    "### Question 1\n",
    "\n",
    "In the cell below configure a spark session that is configured to connect to `mongodb`, `minio`, `cassandra`, '`elasticsearch` and `neo4j`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "ef5ecf9f-0798-4bc9-8896-229a0faade48",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "WARNING: An illegal reflective access operation has occurred\n",
      "WARNING: Illegal reflective access by org.apache.spark.unsafe.Platform (file:/usr/local/spark-3.1.2-bin-hadoop3.2/jars/spark-unsafe_2.12-3.1.2.jar) to constructor java.nio.DirectByteBuffer(long,int)\n",
      "WARNING: Please consider reporting this to the maintainers of org.apache.spark.unsafe.Platform\n",
      "WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations\n",
      "WARNING: All illegal access operations will be denied in a future release\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      ":: loading settings :: url = jar:file:/usr/local/spark-3.1.2-bin-hadoop3.2/jars/ivy-2.4.0.jar!/org/apache/ivy/core/settings/ivysettings.xml\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Ivy Default Cache set to: /home/jovyan/.ivy2/cache\n",
      "The jars for the packages stored in: /home/jovyan/.ivy2/jars\n",
      "com.datastax.spark#spark-cassandra-connector-assembly_2.12 added as a dependency\n",
      "org.elasticsearch#elasticsearch-spark-20_2.12 added as a dependency\n",
      "org.mongodb.spark#mongo-spark-connector_2.12 added as a dependency\n",
      ":: resolving dependencies :: org.apache.spark#spark-submit-parent-730830d0-8bfe-49c4-9455-530ef4754903;1.0\n",
      "\tconfs: [default]\n",
      "\tfound com.datastax.spark#spark-cassandra-connector-assembly_2.12;3.1.0 in central\n",
      "\tfound org.elasticsearch#elasticsearch-spark-20_2.12;7.15.0 in central\n",
      "\tfound org.scala-lang#scala-reflect;2.12.8 in central\n",
      "\tfound org.slf4j#slf4j-api;1.7.6 in central\n",
      "\tfound commons-logging#commons-logging;1.1.1 in central\n",
      "\tfound javax.xml.bind#jaxb-api;2.3.1 in central\n",
      "\tfound com.google.protobuf#protobuf-java;2.5.0 in central\n",
      "\tfound org.apache.spark#spark-yarn_2.12;2.4.4 in central\n",
      "\tfound org.mongodb.spark#mongo-spark-connector_2.12;3.0.1 in central\n",
      "\tfound org.mongodb#mongodb-driver-sync;4.0.5 in central\n",
      "\tfound org.mongodb#bson;4.0.5 in central\n",
      "\tfound org.mongodb#mongodb-driver-core;4.0.5 in central\n",
      "downloading https://repo1.maven.org/maven2/com/datastax/spark/spark-cassandra-connector-assembly_2.12/3.1.0/spark-cassandra-connector-assembly_2.12-3.1.0.jar ...\n",
      "\t[SUCCESSFUL ] com.datastax.spark#spark-cassandra-connector-assembly_2.12;3.1.0!spark-cassandra-connector-assembly_2.12.jar (543ms)\n",
      "downloading https://repo1.maven.org/maven2/org/elasticsearch/elasticsearch-spark-20_2.12/7.15.0/elasticsearch-spark-20_2.12-7.15.0.jar ...\n",
      "\t[SUCCESSFUL ] org.elasticsearch#elasticsearch-spark-20_2.12;7.15.0!elasticsearch-spark-20_2.12.jar (82ms)\n",
      "downloading https://repo1.maven.org/maven2/org/mongodb/spark/mongo-spark-connector_2.12/3.0.1/mongo-spark-connector_2.12-3.0.1.jar ...\n",
      "\t[SUCCESSFUL ] org.mongodb.spark#mongo-spark-connector_2.12;3.0.1!mongo-spark-connector_2.12.jar (29ms)\n",
      "downloading https://repo1.maven.org/maven2/org/mongodb/mongodb-driver-sync/4.0.5/mongodb-driver-sync-4.0.5.jar ...\n",
      "\t[SUCCESSFUL ] org.mongodb#mongodb-driver-sync;4.0.5!mongodb-driver-sync.jar (25ms)\n",
      "downloading https://repo1.maven.org/maven2/org/mongodb/bson/4.0.5/bson-4.0.5.jar ...\n",
      "\t[SUCCESSFUL ] org.mongodb#bson;4.0.5!bson.jar (24ms)\n",
      "downloading https://repo1.maven.org/maven2/org/mongodb/mongodb-driver-core/4.0.5/mongodb-driver-core-4.0.5.jar ...\n",
      "\t[SUCCESSFUL ] org.mongodb#mongodb-driver-core;4.0.5!mongodb-driver-core.jar (58ms)\n",
      ":: resolution report :: resolve 6634ms :: artifacts dl 780ms\n",
      "\t:: modules in use:\n",
      "\tcom.datastax.spark#spark-cassandra-connector-assembly_2.12;3.1.0 from central in [default]\n",
      "\tcom.google.protobuf#protobuf-java;2.5.0 from central in [default]\n",
      "\tcommons-logging#commons-logging;1.1.1 from central in [default]\n",
      "\tjavax.xml.bind#jaxb-api;2.3.1 from central in [default]\n",
      "\torg.apache.spark#spark-yarn_2.12;2.4.4 from central in [default]\n",
      "\torg.elasticsearch#elasticsearch-spark-20_2.12;7.15.0 from central in [default]\n",
      "\torg.mongodb#bson;4.0.5 from central in [default]\n",
      "\torg.mongodb#mongodb-driver-core;4.0.5 from central in [default]\n",
      "\torg.mongodb#mongodb-driver-sync;4.0.5 from central in [default]\n",
      "\torg.mongodb.spark#mongo-spark-connector_2.12;3.0.1 from central in [default]\n",
      "\torg.scala-lang#scala-reflect;2.12.8 from central in [default]\n",
      "\torg.slf4j#slf4j-api;1.7.6 from central in [default]\n",
      "\t---------------------------------------------------------------------\n",
      "\t|                  |            modules            ||   artifacts   |\n",
      "\t|       conf       | number| search|dwnlded|evicted|| number|dwnlded|\n",
      "\t---------------------------------------------------------------------\n",
      "\t|      default     |   12  |   12  |   12  |   0   ||   6   |   6   |\n",
      "\t---------------------------------------------------------------------\n",
      ":: retrieving :: org.apache.spark#spark-submit-parent-730830d0-8bfe-49c4-9455-530ef4754903\n",
      "\tconfs: [default]\n",
      "\t6 artifacts copied, 0 already retrieved (19325kB/108ms)\n",
      "24/04/27 01:34:36 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable\n",
      "Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties\n",
      "Setting default log level to \"WARN\".\n",
      "To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).\n"
     ]
    }
   ],
   "source": [
    "#1 Spark session\n",
    "\n",
    "import pyspark\n",
    "from pyspark.sql import SparkSession\n",
    "\n",
    "user = \"mongo\"\n",
    "passwd = \"SU2orange!\"\n",
    "s3_bucket = \"gamestreams\"\n",
    "s3_server = \"http://minio:9000\"\n",
    "s3_access_key = \"minio\"\n",
    "s3_secret_key = \"SU2orange!\"\n",
    "elastic_host = \"elasticsearch\"\n",
    "elastic_port = \"9200\"\n",
    "cassandra_host = \"cassandra\"\n",
    "bolt_url = \"bolt://neo4j:7687\"\n",
    "\n",
    "mongo_uri = \"mongodb://admin:mongopw@mongo:27017/admin?authSource=admin\"\n",
    "\n",
    "jars = [\n",
    "    \"com.datastax.spark:spark-cassandra-connector-assembly_2.12:3.1.0\",\n",
    "    \"org.elasticsearch:elasticsearch-spark-20_2.12:7.15.0\",\n",
    "    \"org.mongodb.spark:mongo-spark-connector_2.12:3.0.1\"\n",
    "]\n",
    "\n",
    "spark = SparkSession.builder \\\n",
    "    .master(\"local\") \\\n",
    "    .appName('jupyter-pyspark') \\\n",
    "        .config(\"spark.jars.packages\",\",\".join(jars) )\\\n",
    "        .config(\"spark.hadoop.fs.s3a.endpoint\", s3_server ) \\\n",
    "        .config(\"spark.hadoop.fs.s3a.access.key\", s3_access_key) \\\n",
    "        .config(\"spark.hadoop.fs.s3a.secret.key\", s3_secret_key) \\\n",
    "        .config(\"spark.hadoop.fs.s3a.fast.upload\", True) \\\n",
    "        .config(\"spark.hadoop.fs.s3a.path.style.access\", True) \\\n",
    "        .config(\"spark.hadoop.fs.s3a.impl\", \"org.apache.hadoop.fs.s3a.S3AFileSystem\") \\\n",
    "        .config(\"spark.cassandra.connection.host\", cassandra_host) \\\n",
    "        .config(\"spark.es.nodes\", elastic_host) \\\n",
    "        .config(\"spark.es.port\",elastic_port) \\\n",
    "        .config(\"spark.mongodb.input.uri\", mongo_uri) \\\n",
    "        .config(\"spark.mongodb.output.uri\", mongo_uri) \\\n",
    "        .getOrCreate()\n",
    "sc = spark.sparkContext\n",
    "sc.setLogLevel(\"ERROR\") # Keeps the noise down!!!\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3ee055a5-7a8f-4739-a3f5-a52d981ea05e",
   "metadata": {},
   "source": [
    "### Question 2\n",
    "\n",
    "Demonstrate you can read the process-oriented data `enrollments` and `sections` from `minio` using PySpark."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "d50367be-c7ac-43b0-b820-54e4b7d83c98",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+----+-----------------+------+-------+-----------------+-----+------------+\n",
      "|term|course_enrollment|course|section|       student_id|grade|grade_points|\n",
      "+----+-----------------+------+-------+-----------------+-----+------------+\n",
      "|1221|                1|IST659|   M001|      orenjouglad|    C|         2.0|\n",
      "|1221|                2|IST659|   M001|      billmelator|    A|         4.0|\n",
      "|1221|                3|IST659|   M001|       morrisless|    A|         4.0|\n",
      "|1221|                4|IST659|   M001|amberwavesofgrain|   A-|       3.667|\n",
      "|1221|                5|IST659|   M001|         abbykuss|    A|         4.0|\n",
      "|1221|                6|IST659|   M001|       tallyitupp|    A|         4.0|\n",
      "|1221|                7|IST659|   M001|     rubyslippers|   B-|       2.667|\n",
      "|1221|                8|IST659|   M001|          salladd|   A-|       3.667|\n",
      "|1221|                9|IST659|   M001|isabellegunnering|    A|         4.0|\n",
      "|1221|               10|IST659|   M001|        rustycarz|    B|         3.0|\n",
      "|1221|               11|IST659|   M001|      pattyo'beef|    A|         4.0|\n",
      "|1221|               12|IST659|   M001|        tyitdowne|    A|         4.0|\n",
      "|1221|               13|IST659|   M001|        windysees|    A|         4.0|\n",
      "|1221|               14|IST659|   M001|      gingersnaps|   A-|       3.667|\n",
      "|1221|               15|IST659|   M001|        harrypits|    A|         4.0|\n",
      "|1221|               16|IST659|   M001|        frankklee|    A|         4.0|\n",
      "|1221|               17|IST659|   M001|   chrispeanugget|    A|         4.0|\n",
      "|1221|               18|IST659|   M001|    isrealornotte|   A-|       3.667|\n",
      "|1221|               19|IST659|   M001|      windyshores|    A|         4.0|\n",
      "|1221|               20|IST659|   M001|     mistymeadows|    A|         4.0|\n",
      "+----+-----------------+------+-------+-----------------+-----+------------+\n",
      "only showing top 20 rows\n",
      "\n",
      "root\n",
      " |-- term: integer (nullable = true)\n",
      " |-- course_enrollment: integer (nullable = true)\n",
      " |-- course: string (nullable = true)\n",
      " |-- section: string (nullable = true)\n",
      " |-- student_id: string (nullable = true)\n",
      " |-- grade: string (nullable = true)\n",
      " |-- grade_points: double (nullable = true)\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "743"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#2a enrollments\n",
    "enrollment = spark.read.option(\"header\", True).option(\"inferSchema\", True).option(\"sep\", \",\").csv(\"s3a://enrollments/enrollments.csv\")\\\n",
    ".toDF(\"term\", \"course_enrollment\", \"course\", \"section\", \"student_id\", \"grade\", \"grade_points\")\n",
    "\n",
    "enrollment.show()\n",
    "enrollment.printSchema()\n",
    "enrollment.count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "8b415479-5acf-42dc-b535-c80bc62d239b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+----+------+-------+----------+--------+\n",
      "|term|course|section|enrollment|capacity|\n",
      "+----+------+-------+----------+--------+\n",
      "|1221|IST659|   M001|        20|      20|\n",
      "|1221|IST659|   M002|        20|      20|\n",
      "|1221|IST722|   M001|        25|      28|\n",
      "|1221|IST615|   M001|        22|      28|\n",
      "|1221|IST621|   M001|        22|      24|\n",
      "|1221|IST687|   M001|        20|      20|\n",
      "|1221|IST687|   M002|        21|      24|\n",
      "|1221|IST707|   M001|        28|      28|\n",
      "|1222|IST659|   M001|        24|      24|\n",
      "|1222|IST769|   M001|        19|      24|\n",
      "|1222|IST615|   M001|        19|      24|\n",
      "|1222|IST714|   M001|        17|      20|\n",
      "|1222|IST621|   M001|        28|      28|\n",
      "|1222|IST621|   M002|        22|      24|\n",
      "|1222|IST687|   M001|        18|      20|\n",
      "|1222|IST687|   M002|        20|      20|\n",
      "|1222|IST718|   M001|        28|      28|\n",
      "|1231|IST659|   M001|        20|      20|\n",
      "|1231|IST659|   M002|        20|      20|\n",
      "|1231|IST722|   M001|        23|      28|\n",
      "+----+------+-------+----------+--------+\n",
      "only showing top 20 rows\n",
      "\n",
      "root\n",
      " |-- term: integer (nullable = true)\n",
      " |-- course: string (nullable = true)\n",
      " |-- section: string (nullable = true)\n",
      " |-- enrollment: integer (nullable = true)\n",
      " |-- capacity: integer (nullable = true)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "#2b sections \n",
    "sections = spark.read.option(\"header\", True).option(\"inferSchema\", True).option(\"sep\", \",\").csv(\"s3a://enrollments/sections.csv\")\\\n",
    ".toDF(\"term\", \"course\",\"section\",\"enrollment\", \"capacity\")\n",
    "\n",
    "sections.show()\n",
    "sections.printSchema()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "74906498-d775-451f-befd-5e88595b7009",
   "metadata": {},
   "source": [
    "### Question 3\n",
    "\n",
    "Demonstrate you can read the reference-oriented data `terms`, `students`, `courses`, and `program` reference data from `MongoDb` using PySpark. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "1f928bc1-1306-42d7-a073-c7673dde4f62",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+----+-------------+----+-----------+--------+----+\n",
      "| _id|academic_year|code|       name|semester|year|\n",
      "+----+-------------+----+-----------+--------+----+\n",
      "|1221|    2021-2022|1221|  Fall 2021|    Fall|2021|\n",
      "|1222|    2021-2022|1222|Spring 2022|  Spring|2022|\n",
      "|1231|    2022-2023|1231|  Fall 2022|    Fall|2022|\n",
      "|1232|    2022-2023|1232|Spring 2023|  Spring|2023|\n",
      "+----+-------------+----+-----------+--------+----+\n",
      "\n",
      "root\n",
      " |-- _id: string (nullable = true)\n",
      " |-- academic_year: string (nullable = true)\n",
      " |-- code: string (nullable = true)\n",
      " |-- name: string (nullable = true)\n",
      " |-- semester: string (nullable = true)\n",
      " |-- year: integer (nullable = true)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "#3a terms \n",
    "terms = spark.read.format(\"mongo\").option(\"database\",\"ischooldb\").option(\"collection\",\"terms\").load()\n",
    "terms.show()\n",
    "terms.printSchema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "b917eaca-2e3e-45ab-84aa-bc2f07bf6e86",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+------+------+-------+--------------------+--------------------+----------------+--------------------+-------------+--------------------+\n",
      "|   _id|  code|credits|         description|elective_in_programs| key_assignments|                name|prerequisites|required_in_programs|\n",
      "+------+------+-------+--------------------+--------------------+----------------+--------------------+-------------+--------------------+\n",
      "|IST659|IST659|      3|Definition, devel...|                  []|       [project]|Data Administrati...|           []|            [IS, DS]|\n",
      "|IST722|IST722|      3|Introduction to c...|                [IS]| [project, exam]|    Data Warehousing|     [IST659]|                  []|\n",
      "|IST769|IST769|      3|Analyze relationa...|                [DS]| [project, exam]|Advanced Big Data...|     [IST659]|                  []|\n",
      "|IST615|IST615|      3|Cloud services cr...|                  []|[project, paper]|    Cloud Management|           []|            [IS, DS]|\n",
      "|IST714|IST714|      3|Advanced, lab-bas...|            [IS, DS]|       [project]|  Cloud Architecture|     [IST615]|                  []|\n",
      "|IST621|IST621|      3|Information and t...|                  []|         [paper]|Information Manag...|           []|                [IS]|\n",
      "|IST687|IST687|      3|Introduces inform...|                [IS]| [project, exam]|Introduction to D...|           []|                [DS]|\n",
      "|IST707|IST707|      3|General overview ...|                [IS]|          [exam]|Applied Machine L...|     [IST687]|                [DS]|\n",
      "|IST718|IST718|      3|A broad introduct...|                  []|       [project]|  Big Data Analytics|     [IST687]|                [DS]|\n",
      "+------+------+-------+--------------------+--------------------+----------------+--------------------+-------------+--------------------+\n",
      "\n",
      "root\n",
      " |-- _id: string (nullable = true)\n",
      " |-- code: string (nullable = true)\n",
      " |-- credits: integer (nullable = true)\n",
      " |-- description: string (nullable = true)\n",
      " |-- elective_in_programs: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- key_assignments: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- name: string (nullable = true)\n",
      " |-- prerequisites: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- required_in_programs: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "#3b courses\n",
    "courses = spark.read.format(\"mongo\").option(\"database\",\"ischooldb\").option(\"collection\",\"courses\").load()\n",
    "courses.show(100)\n",
    "courses.printSchema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "8f483a03-3da6-4efa-95d7-06c82e556400",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+---+----+-------+--------------------+--------------------+--------------------+-----------+\n",
      "|_id|code|credits|    elective_courses|                name|    required_courses|       type|\n",
      "+---+----+-------+--------------------+--------------------+--------------------+-----------+\n",
      "| IS|  IS|     36|[IST722, IST714, ...| Information Systems|[IST659, IST615, ...|    Masters|\n",
      "| DS|  DS|     34|    [IST769, IST714]|        Data Science|[IST659, IST615, ...|    Masters|\n",
      "|BDC| BDC|      9|                null|Data Engineering ...|[IST659, IST722, ...|Certificate|\n",
      "|CCC| CCC|      9|                null|Cloud Computing C...|[IST621, IST615, ...|Certificate|\n",
      "|MLC| MLC|      9|                null|Machine Learning ...|[IST687, IST707, ...|Certificate|\n",
      "+---+----+-------+--------------------+--------------------+--------------------+-----------+\n",
      "\n",
      "root\n",
      " |-- _id: string (nullable = true)\n",
      " |-- code: string (nullable = true)\n",
      " |-- credits: integer (nullable = true)\n",
      " |-- elective_courses: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- name: string (nullable = true)\n",
      " |-- required_courses: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- type: string (nullable = true)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "#3c Programs\n",
    "programs = spark.read.format(\"mongo\").option(\"database\",\"ischooldb\").option(\"collection\",\"programs\").load()\n",
    "programs.show(100)\n",
    "programs.printSchema()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "88d87294-61eb-4dd4-8b7a-5c280b6b7c8c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----------------+------------------+-------+\n",
      "|              _id|              name|program|\n",
      "+-----------------+------------------+-------+\n",
      "|         abbykuss|         Abby Kuss|     DS|\n",
      "|       adamantium|       Adam Antium|     IS|\n",
      "|        addieowse|        Addie Owse|     IS|\n",
      "|     aidensomewun|     Aiden Somewun|     IS|\n",
      "|     aidenknowone|     Aiden Knowone|     DS|\n",
      "|         alfrecso|         Al Frecso|     DS|\n",
      "|          alkohol|          Al Kohol|     DS|\n",
      "|      allanwrench|      Allan Wrench|     IS|\n",
      "|        allygator|        Ally Gator|     IS|\n",
      "|  almafrienzergon|  Alma Frienzergon|     IS|\n",
      "| amandahugginkiss| Amanda Hugginkiss|     IS|\n",
      "|amberwavesofgrain|Amber Wavesofgrain|     DS|\n",
      "|         anitajob|         Anita Job|     IS|\n",
      "|       anitafavor|       Anita Favor|     IS|\n",
      "|      anitashower|      Anita Shower|     DS|\n",
      "|    anitasandwich|    Anita Sandwich|     DS|\n",
      "|        annedewey|        Anne Dewey|     IS|\n",
      "|       aprilfirst|       April First|     DS|\n",
      "|       arialphoto|       Arial Photo|     DS|\n",
      "| arialsurvellence| Arial Survellence|     IS|\n",
      "+-----------------+------------------+-------+\n",
      "only showing top 20 rows\n",
      "\n",
      "root\n",
      " |-- _id: string (nullable = true)\n",
      " |-- name: string (nullable = true)\n",
      " |-- program: string (nullable = true)\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "235"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#3d students\n",
    "students = spark.read.format(\"mongo\").option(\"database\",\"ischooldb\").option(\"collection\",\"students\").load()\n",
    "students.show()\n",
    "students.printSchema()\n",
    "students.count()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8abfca28-8272-46ee-b98c-6a263be01c56",
   "metadata": {},
   "source": [
    "### Question 4\n",
    "\n",
    "Prepare the `section` data for loading into `cassandra` and `elasticsearch` with Spark or Spark SQL. Just PREPARE it do not LOAD it. Remember that we want this data to be as wide as possible, so include all relevant reference data. For example, the `section` data should include `term` attributes like `year`,  `academic year`, etc... and from `course`, attributes like `credits`, `name`, `prerequisites`, etc... \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "6e8a9218-9dc1-4e69-87d8-90274d579ae0",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "root\n",
      " |-- term: integer (nullable = true)\n",
      " |-- course: string (nullable = true)\n",
      " |-- section: string (nullable = true)\n",
      " |-- enrollment: integer (nullable = true)\n",
      " |-- capacity: integer (nullable = true)\n",
      " |-- _id: string (nullable = true)\n",
      " |-- academic_year: string (nullable = true)\n",
      " |-- code: string (nullable = true)\n",
      " |-- name: string (nullable = true)\n",
      " |-- semester: string (nullable = true)\n",
      " |-- year: integer (nullable = true)\n",
      " |-- _id: string (nullable = true)\n",
      " |-- code: string (nullable = true)\n",
      " |-- credits: integer (nullable = true)\n",
      " |-- description: string (nullable = true)\n",
      " |-- elective_in_programs: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- key_assignments: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- course_name: string (nullable = true)\n",
      " |-- prerequisites: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- required_in_programs: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      "\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+----+------+-------+----------+--------+----+-------------+----+-----------+--------+----+------+------+-------+--------------------+--------------------+----------------+--------------------+-------------+--------------------+\n",
      "|term|course|section|enrollment|capacity| _id|academic_year|code|       name|semester|year|   _id|  code|credits|         description|elective_in_programs| key_assignments|         course_name|prerequisites|required_in_programs|\n",
      "+----+------+-------+----------+--------+----+-------------+----+-----------+--------+----+------+------+-------+--------------------+--------------------+----------------+--------------------+-------------+--------------------+\n",
      "|1221|IST615|   M001|        22|      28|1221|    2021-2022|1221|  Fall 2021|    Fall|2021|IST615|IST615|      3|Cloud services cr...|                  []|[project, paper]|    Cloud Management|           []|            [IS, DS]|\n",
      "|1222|IST615|   M001|        19|      24|1222|    2021-2022|1222|Spring 2022|  Spring|2022|IST615|IST615|      3|Cloud services cr...|                  []|[project, paper]|    Cloud Management|           []|            [IS, DS]|\n",
      "|1231|IST615|   M001|        21|      24|1231|    2022-2023|1231|  Fall 2022|    Fall|2022|IST615|IST615|      3|Cloud services cr...|                  []|[project, paper]|    Cloud Management|           []|            [IS, DS]|\n",
      "|1232|IST615|   M002|        20|      24|1232|    2022-2023|1232|Spring 2023|  Spring|2023|IST615|IST615|      3|Cloud services cr...|                  []|[project, paper]|    Cloud Management|           []|            [IS, DS]|\n",
      "|1232|IST615|   M001|        21|      28|1232|    2022-2023|1232|Spring 2023|  Spring|2023|IST615|IST615|      3|Cloud services cr...|                  []|[project, paper]|    Cloud Management|           []|            [IS, DS]|\n",
      "|1221|IST659|   M002|        20|      20|1221|    2021-2022|1221|  Fall 2021|    Fall|2021|IST659|IST659|      3|Definition, devel...|                  []|       [project]|Data Administrati...|           []|            [IS, DS]|\n",
      "|1221|IST659|   M001|        20|      20|1221|    2021-2022|1221|  Fall 2021|    Fall|2021|IST659|IST659|      3|Definition, devel...|                  []|       [project]|Data Administrati...|           []|            [IS, DS]|\n",
      "|1222|IST659|   M001|        24|      24|1222|    2021-2022|1222|Spring 2022|  Spring|2022|IST659|IST659|      3|Definition, devel...|                  []|       [project]|Data Administrati...|           []|            [IS, DS]|\n",
      "|1231|IST659|   M002|        20|      20|1231|    2022-2023|1231|  Fall 2022|    Fall|2022|IST659|IST659|      3|Definition, devel...|                  []|       [project]|Data Administrati...|           []|            [IS, DS]|\n",
      "|1231|IST659|   M001|        20|      20|1231|    2022-2023|1231|  Fall 2022|    Fall|2022|IST659|IST659|      3|Definition, devel...|                  []|       [project]|Data Administrati...|           []|            [IS, DS]|\n",
      "|1232|IST659|   M001|        20|      20|1232|    2022-2023|1232|Spring 2023|  Spring|2023|IST659|IST659|      3|Definition, devel...|                  []|       [project]|Data Administrati...|           []|            [IS, DS]|\n",
      "|1221|IST687|   M002|        21|      24|1221|    2021-2022|1221|  Fall 2021|    Fall|2021|IST687|IST687|      3|Introduces inform...|                [IS]| [project, exam]|Introduction to D...|           []|                [DS]|\n",
      "|1221|IST687|   M001|        20|      20|1221|    2021-2022|1221|  Fall 2021|    Fall|2021|IST687|IST687|      3|Introduces inform...|                [IS]| [project, exam]|Introduction to D...|           []|                [DS]|\n",
      "|1222|IST687|   M002|        20|      20|1222|    2021-2022|1222|Spring 2022|  Spring|2022|IST687|IST687|      3|Introduces inform...|                [IS]| [project, exam]|Introduction to D...|           []|                [DS]|\n",
      "|1222|IST687|   M001|        18|      20|1222|    2021-2022|1222|Spring 2022|  Spring|2022|IST687|IST687|      3|Introduces inform...|                [IS]| [project, exam]|Introduction to D...|           []|                [DS]|\n",
      "|1231|IST687|   M002|        20|      24|1231|    2022-2023|1231|  Fall 2022|    Fall|2022|IST687|IST687|      3|Introduces inform...|                [IS]| [project, exam]|Introduction to D...|           []|                [DS]|\n",
      "|1231|IST687|   M001|        17|      20|1231|    2022-2023|1231|  Fall 2022|    Fall|2022|IST687|IST687|      3|Introduces inform...|                [IS]| [project, exam]|Introduction to D...|           []|                [DS]|\n",
      "|1232|IST687|   M001|        19|      24|1232|    2022-2023|1232|Spring 2023|  Spring|2023|IST687|IST687|      3|Introduces inform...|                [IS]| [project, exam]|Introduction to D...|           []|                [DS]|\n",
      "|1221|IST707|   M001|        28|      28|1221|    2021-2022|1221|  Fall 2021|    Fall|2021|IST707|IST707|      3|General overview ...|                [IS]|          [exam]|Applied Machine L...|     [IST687]|                [DS]|\n",
      "|1231|IST707|   M001|        24|      24|1231|    2022-2023|1231|  Fall 2022|    Fall|2022|IST707|IST707|      3|General overview ...|                [IS]|          [exam]|Applied Machine L...|     [IST687]|                [DS]|\n",
      "|1222|IST769|   M001|        19|      24|1222|    2021-2022|1222|Spring 2022|  Spring|2022|IST769|IST769|      3|Analyze relationa...|                [DS]| [project, exam]|Advanced Big Data...|     [IST659]|                  []|\n",
      "|1232|IST769|   M001|        20|      24|1232|    2022-2023|1232|Spring 2023|  Spring|2023|IST769|IST769|      3|Analyze relationa...|                [DS]| [project, exam]|Advanced Big Data...|     [IST659]|                  []|\n",
      "|1221|IST722|   M001|        25|      28|1221|    2021-2022|1221|  Fall 2021|    Fall|2021|IST722|IST722|      3|Introduction to c...|                [IS]| [project, exam]|    Data Warehousing|     [IST659]|                  []|\n",
      "|1231|IST722|   M001|        23|      28|1231|    2022-2023|1231|  Fall 2022|    Fall|2022|IST722|IST722|      3|Introduction to c...|                [IS]| [project, exam]|    Data Warehousing|     [IST659]|                  []|\n",
      "|1221|IST621|   M001|        22|      24|1221|    2021-2022|1221|  Fall 2021|    Fall|2021|IST621|IST621|      3|Information and t...|                  []|         [paper]|Information Manag...|           []|                [IS]|\n",
      "|1222|IST621|   M002|        22|      24|1222|    2021-2022|1222|Spring 2022|  Spring|2022|IST621|IST621|      3|Information and t...|                  []|         [paper]|Information Manag...|           []|                [IS]|\n",
      "|1222|IST621|   M001|        28|      28|1222|    2021-2022|1222|Spring 2022|  Spring|2022|IST621|IST621|      3|Information and t...|                  []|         [paper]|Information Manag...|           []|                [IS]|\n",
      "|1231|IST621|   M001|        28|      28|1231|    2022-2023|1231|  Fall 2022|    Fall|2022|IST621|IST621|      3|Information and t...|                  []|         [paper]|Information Manag...|           []|                [IS]|\n",
      "|1232|IST621|   M002|        21|      24|1232|    2022-2023|1232|Spring 2023|  Spring|2023|IST621|IST621|      3|Information and t...|                  []|         [paper]|Information Manag...|           []|                [IS]|\n",
      "|1232|IST621|   M001|        28|      28|1232|    2022-2023|1232|Spring 2023|  Spring|2023|IST621|IST621|      3|Information and t...|                  []|         [paper]|Information Manag...|           []|                [IS]|\n",
      "|1222|IST718|   M001|        28|      28|1222|    2021-2022|1222|Spring 2022|  Spring|2022|IST718|IST718|      3|A broad introduct...|                  []|       [project]|  Big Data Analytics|     [IST687]|                [DS]|\n",
      "|1232|IST718|   M001|        28|      28|1232|    2022-2023|1232|Spring 2023|  Spring|2023|IST718|IST718|      3|A broad introduct...|                  []|       [project]|  Big Data Analytics|     [IST687]|                [DS]|\n",
      "|1222|IST714|   M001|        17|      20|1222|    2021-2022|1222|Spring 2022|  Spring|2022|IST714|IST714|      3|Advanced, lab-bas...|            [IS, DS]|       [project]|  Cloud Architecture|     [IST615]|                  []|\n",
      "|1232|IST714|   M001|        20|      24|1232|    2022-2023|1232|Spring 2023|  Spring|2023|IST714|IST714|      3|Advanced, lab-bas...|            [IS, DS]|       [project]|  Cloud Architecture|     [IST615]|                  []|\n",
      "+----+------+-------+----------+--------+----+-------------+----+-----------+--------+----+------+------+-------+--------------------+--------------------+----------------+--------------------+-------------+--------------------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "#4 wide_sections \n",
    "#743\n",
    "courses = courses.withColumnRenamed(\"name\",\"course_name\")\n",
    "combined = sections.join(terms,sections[\"term\"] == terms[\"_id\"],\"inner\")\n",
    "section = combined.join(courses,combined[\"course\"] == courses[\"_id\"],\"inner\")\n",
    "section.count()   \n",
    "section.printSchema()\n",
    "section.show(34)\n",
    "section = section.select('term','course','section','enrollment','capacity','academic_year','name','semester','year','credits','description','elective_in_programs','key_assignments','course_name','prerequisites','required_in_programs')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "03f972cf-8ab1-48fe-b2ff-607acc11e05d",
   "metadata": {},
   "source": [
    "### Question 5\n",
    "\n",
    "Use the `cassandra-driver` example from class to write python code to connect to cassandra from within Jupyter and create a keyspace named `ischooldb`. Design a cassandra table called `sections` to store the data from question 4. Appropriate key design is important! Please explain your justification for key below your table definition. Provide clear evidence that your table was created by querying the empty table in spark and use `printSchema\n",
    "()` to show the schema. \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "4015e68d-c1d0-4bb6-962e-f42bdaeb28c8",
   "metadata": {},
   "outputs": [],
   "source": [
    "#5 create cassandra table for wide_sections\n",
    "    \n",
    "!pip install -q cassandra-driver\n",
    "    \n",
    "from cassandra.cluster import Cluster\n",
    "with Cluster([cassandra_host]) as cluster:\n",
    "    session = cluster.connect()\n",
    "    session.execute(\"CREATE KEYSPACE IF NOT EXISTS ischooldb WITH replication={ 'class': 'SimpleStrategy', 'replication_factor' : 1 };\")\n",
    "    table = '''\n",
    "    CREATE TABLE IF NOT EXISTS ischooldb.sections (\n",
    "        term INT,\n",
    "        course TEXT,\n",
    "        section TEXT,\n",
    "        enrollment INT,\n",
    "        capacity INT,\n",
    "        academic_year TEXT,\n",
    "        name TEXT,\n",
    "        semester TEXT,\n",
    "        year INT,\n",
    "        credits INT,\n",
    "        description TEXT,\n",
    "        course_name TEXT,\n",
    "        elective_in_programs  LIST<text> ,\n",
    "        key_assignments  LIST<text>,\n",
    "        prerequisites  LIST<text>,\n",
    "        required_in_programs  LIST<text>,\n",
    "        PRIMARY KEY((term, course),section));\n",
    " \n",
    "    '''\n",
    "    session.execute(table)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ee71b3b5-03d7-456d-a64f-f3c5f0c93836",
   "metadata": {},
   "source": [
    "### Question 6\n",
    "\n",
    "Load the data frame you created in question 4 into the `cassandra` table you created in question 5. Demonstrate the data is in the table by querying back it with PySpark. Make sure you can run the code multiple times and each time it replaces the existing data."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "59e9aac0-da49-4c82-8e3f-184b5f1d9eb4",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    }
   ],
   "source": [
    "#6 load wide_sections into cassandra\n",
    "\n",
    "section.write.format(\"org.apache.spark.sql.cassandra\")\\\n",
    "  .mode(\"Append\")\\\n",
    "  .option(\"table\", \"sections\")\\\n",
    "  .option(\"keyspace\", \"ischooldb\")\\\n",
    "  .save()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a052fbcc-b7cc-4fa7-ba5d-09b3066c8b96",
   "metadata": {},
   "source": [
    "### Question 7\n",
    "\n",
    "Since we did not learn how to create a custom elasticsearch mapping, before you can load the data into `elasticsearch` you will need to flatten the nested data. For example, `course_is_elective_in_programs` should generate 2 columns `course_is_elective_for_IS` and `course_is_elective_for_DS`. You'll need to repeat this step for `course_is_required_in_programs`. Omit the `course_prerequisites` and `course_key_assignments` column. \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "99f91002-2880-4f4c-8392-9b869ce42172",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "[Stage 73:=====================================================> (97 + 1) / 100]\r"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+----+------+-------+----------+--------+-------------+-----------+--------+----+-------+--------------------+--------------------+--------------------+--------------------+-------------------------+-------------------------+-------------------------+-------------------------+\n",
      "|term|course|section|enrollment|capacity|academic_year|       name|semester|year|credits|         description|elective_in_programs|         course_name|required_in_programs|course_is_elective_for_IS|course_is_elective_for_DS|course_is_required_for_IS|course_is_required_for_DS|\n",
      "+----+------+-------+----------+--------+-------------+-----------+--------+----+-------+--------------------+--------------------+--------------------+--------------------+-------------------------+-------------------------+-------------------------+-------------------------+\n",
      "|1221|IST615|   M001|        22|      28|    2021-2022|  Fall 2021|    Fall|2021|      3|Cloud services cr...|                  []|    Cloud Management|            [IS, DS]|                       no|                       no|                      yes|                      yes|\n",
      "|1222|IST615|   M001|        19|      24|    2021-2022|Spring 2022|  Spring|2022|      3|Cloud services cr...|                  []|    Cloud Management|            [IS, DS]|                       no|                       no|                      yes|                      yes|\n",
      "|1231|IST615|   M001|        21|      24|    2022-2023|  Fall 2022|    Fall|2022|      3|Cloud services cr...|                  []|    Cloud Management|            [IS, DS]|                       no|                       no|                      yes|                      yes|\n",
      "|1232|IST615|   M002|        20|      24|    2022-2023|Spring 2023|  Spring|2023|      3|Cloud services cr...|                  []|    Cloud Management|            [IS, DS]|                       no|                       no|                      yes|                      yes|\n",
      "|1232|IST615|   M001|        21|      28|    2022-2023|Spring 2023|  Spring|2023|      3|Cloud services cr...|                  []|    Cloud Management|            [IS, DS]|                       no|                       no|                      yes|                      yes|\n",
      "|1221|IST659|   M002|        20|      20|    2021-2022|  Fall 2021|    Fall|2021|      3|Definition, devel...|                  []|Data Administrati...|            [IS, DS]|                       no|                       no|                      yes|                      yes|\n",
      "|1221|IST659|   M001|        20|      20|    2021-2022|  Fall 2021|    Fall|2021|      3|Definition, devel...|                  []|Data Administrati...|            [IS, DS]|                       no|                       no|                      yes|                      yes|\n",
      "|1222|IST659|   M001|        24|      24|    2021-2022|Spring 2022|  Spring|2022|      3|Definition, devel...|                  []|Data Administrati...|            [IS, DS]|                       no|                       no|                      yes|                      yes|\n",
      "|1231|IST659|   M002|        20|      20|    2022-2023|  Fall 2022|    Fall|2022|      3|Definition, devel...|                  []|Data Administrati...|            [IS, DS]|                       no|                       no|                      yes|                      yes|\n",
      "|1231|IST659|   M001|        20|      20|    2022-2023|  Fall 2022|    Fall|2022|      3|Definition, devel...|                  []|Data Administrati...|            [IS, DS]|                       no|                       no|                      yes|                      yes|\n",
      "|1232|IST659|   M001|        20|      20|    2022-2023|Spring 2023|  Spring|2023|      3|Definition, devel...|                  []|Data Administrati...|            [IS, DS]|                       no|                       no|                      yes|                      yes|\n",
      "|1221|IST687|   M002|        21|      24|    2021-2022|  Fall 2021|    Fall|2021|      3|Introduces inform...|                [IS]|Introduction to D...|                [DS]|                      yes|                       no|                       no|                      yes|\n",
      "|1221|IST687|   M001|        20|      20|    2021-2022|  Fall 2021|    Fall|2021|      3|Introduces inform...|                [IS]|Introduction to D...|                [DS]|                      yes|                       no|                       no|                      yes|\n",
      "|1222|IST687|   M002|        20|      20|    2021-2022|Spring 2022|  Spring|2022|      3|Introduces inform...|                [IS]|Introduction to D...|                [DS]|                      yes|                       no|                       no|                      yes|\n",
      "|1222|IST687|   M001|        18|      20|    2021-2022|Spring 2022|  Spring|2022|      3|Introduces inform...|                [IS]|Introduction to D...|                [DS]|                      yes|                       no|                       no|                      yes|\n",
      "|1231|IST687|   M002|        20|      24|    2022-2023|  Fall 2022|    Fall|2022|      3|Introduces inform...|                [IS]|Introduction to D...|                [DS]|                      yes|                       no|                       no|                      yes|\n",
      "|1231|IST687|   M001|        17|      20|    2022-2023|  Fall 2022|    Fall|2022|      3|Introduces inform...|                [IS]|Introduction to D...|                [DS]|                      yes|                       no|                       no|                      yes|\n",
      "|1232|IST687|   M001|        19|      24|    2022-2023|Spring 2023|  Spring|2023|      3|Introduces inform...|                [IS]|Introduction to D...|                [DS]|                      yes|                       no|                       no|                      yes|\n",
      "|1221|IST707|   M001|        28|      28|    2021-2022|  Fall 2021|    Fall|2021|      3|General overview ...|                [IS]|Applied Machine L...|                [DS]|                      yes|                       no|                       no|                      yes|\n",
      "|1231|IST707|   M001|        24|      24|    2022-2023|  Fall 2022|    Fall|2022|      3|General overview ...|                [IS]|Applied Machine L...|                [DS]|                      yes|                       no|                       no|                      yes|\n",
      "+----+------+-------+----------+--------+-------------+-----------+--------+----+-------+--------------------+--------------------+--------------------+--------------------+-------------------------+-------------------------+-------------------------+-------------------------+\n",
      "only showing top 20 rows\n",
      "\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    }
   ],
   "source": [
    "#7 flatten `course_is_elective_in_programs` and `course_is_required_in_programs` \n",
    "from pyspark.sql.functions import when, array_contains\n",
    "\n",
    "df = section.withColumn(\"course_is_elective_for_IS\",when(array_contains(section[\"elective_in_programs\"], \"IS\"), \"yes\").otherwise(\"no\"))\n",
    "\n",
    "df = df.withColumn(\"course_is_elective_for_DS\",when(array_contains(df[\"elective_in_programs\"], \"DS\"), \"yes\").otherwise(\"no\"))\n",
    "\n",
    "df = df.withColumn(\"course_is_required_for_IS\",when(array_contains(df[\"required_in_programs\"], \"IS\"), \"yes\").otherwise(\"no\"))\n",
    "\n",
    "df = df.withColumn(\"course_is_required_for_DS\",when(array_contains(df[\"required_in_programs\"], \"DS\"), \"yes\").otherwise(\"no\"))\n",
    "\n",
    "df = df.drop(\"prerequisites\", \"key_assignments\")\n",
    "\n",
    "# Show the transformed DataFrame\n",
    "df.show()\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "29dd3d88-efe9-4d0c-90ce-941ef6de84e2",
   "metadata": {},
   "source": [
    "### Question 8\n",
    "\n",
    "Load the data frame you created in question 7 into `elasticsearch`, under the index `sections`.  Demonstrate the data is in the index by querying back it with PySpark. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "39d2c484-7857-4064-a60c-c1ec0004b370",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "root\n",
      " |-- term: integer (nullable = true)\n",
      " |-- course: string (nullable = true)\n",
      " |-- section: string (nullable = true)\n",
      " |-- enrollment: integer (nullable = true)\n",
      " |-- capacity: integer (nullable = true)\n",
      " |-- academic_year: string (nullable = true)\n",
      " |-- name: string (nullable = true)\n",
      " |-- semester: string (nullable = true)\n",
      " |-- year: integer (nullable = true)\n",
      " |-- credits: integer (nullable = true)\n",
      " |-- description: string (nullable = true)\n",
      " |-- elective_in_programs: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- course_name: string (nullable = true)\n",
      " |-- required_in_programs: array (nullable = true)\n",
      " |    |-- element: string (containsNull = true)\n",
      " |-- course_is_elective_for_IS: string (nullable = false)\n",
      " |-- course_is_elective_for_DS: string (nullable = false)\n",
      " |-- course_is_required_for_IS: string (nullable = false)\n",
      " |-- course_is_required_for_DS: string (nullable = false)\n",
      "\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    }
   ],
   "source": [
    "#8 load wide_sections_flattened into elasticsearch\n",
    "df.printSchema()\n",
    "df.write.mode(\"Overwrite\").format(\"es\").save(\"sections/_doc\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aa738b4b-6970-46d4-b5dc-3c766f7fe64b",
   "metadata": {},
   "source": [
    "### Question 9\n",
    "\n",
    "Similar to question 4, prepare the `enrollments` for loading into `cassandra` and `elasticsearch` with Spark or Spark SQL. For this wide table we want to include the same reference data for `sections` but include the `student` attributes and the `program` data associated with the student. \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "ce4ea5ef-282b-4aca-86c3-5401ef105088",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----------------+------------------+-------+---+----+-------------+----------------+------------+--------------------+-------+-----------+-----------------+-------------+--------------+-----------------+-----+------------+\n",
      "|       lower_name|      student_name|program|_id|code|total_credits|elective_courses|program_name|    required_courses|   type|enroll_term|course_enrollment|enroll_course|enroll_section|       student_id|grade|grade_points|\n",
      "+-----------------+------------------+-------+---+----+-------------+----------------+------------+--------------------+-------+-----------+-----------------+-------------+--------------+-----------------+-----+------------+\n",
      "|         abbykuss|         Abby Kuss|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1232|                9|       IST621|          M001|         abbykuss|   A-|       3.667|\n",
      "|         abbykuss|         Abby Kuss|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1231|                6|       IST722|          M001|         abbykuss|   A-|       3.667|\n",
      "|         abbykuss|         Abby Kuss|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1221|               12|       IST707|          M001|         abbykuss|   A-|       3.667|\n",
      "|         abbykuss|         Abby Kuss|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1221|               11|       IST687|          M002|         abbykuss|    A|         4.0|\n",
      "|         abbykuss|         Abby Kuss|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1221|                5|       IST659|          M001|         abbykuss|    A|         4.0|\n",
      "|     aidenknowone|     Aiden Knowone|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1221|                4|       IST621|          M001|     aidenknowone|    A|         4.0|\n",
      "|         alfrecso|         Al Frecso|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1232|               25|       IST621|          M001|         alfrecso|   C+|       2.333|\n",
      "|         alfrecso|         Al Frecso|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1222|               19|       IST615|          M001|         alfrecso|    A|         4.0|\n",
      "|          alkohol|          Al Kohol|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1222|               15|       IST621|          M001|          alkohol|    A|         4.0|\n",
      "|amberwavesofgrain|Amber Wavesofgrain|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1232|               10|       IST621|          M001|amberwavesofgrain|    A|         4.0|\n",
      "|amberwavesofgrain|Amber Wavesofgrain|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1231|                9|       IST722|          M001|amberwavesofgrain|   A-|       3.667|\n",
      "|amberwavesofgrain|Amber Wavesofgrain|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1221|                4|       IST659|          M001|amberwavesofgrain|   A-|       3.667|\n",
      "|    anitasandwich|    Anita Sandwich|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1232|               20|       IST718|          M001|    anitasandwich|    A|         4.0|\n",
      "|    anitasandwich|    Anita Sandwich|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1232|               12|       IST621|          M001|    anitasandwich|   B-|       2.667|\n",
      "|    anitasandwich|    Anita Sandwich|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1221|                5|       IST687|          M002|    anitasandwich|   A-|       3.667|\n",
      "|      anitashower|      Anita Shower|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1222|               19|       IST687|          M002|      anitashower|    A|         4.0|\n",
      "|      anitashower|      Anita Shower|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1222|               12|       IST621|          M002|      anitashower|    A|         4.0|\n",
      "|       aprilfirst|       April First|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1232|               25|       IST718|          M001|       aprilfirst|   A-|       3.667|\n",
      "|       aprilfirst|       April First|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1232|               13|       IST621|          M001|       aprilfirst|    C|         2.0|\n",
      "|       aprilfirst|       April First|     DS| DS|  DS|           34|[IST769, IST714]|Data Science|[IST659, IST615, ...|Masters|       1222|               14|       IST687|          M002|       aprilfirst|    A|         4.0|\n",
      "+-----------------+------------------+-------+---+----+-------------+----------------+------------+--------------------+-------+-----------+-----------------+-------------+--------------+-----------------+-----+------------+\n",
      "only showing top 20 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "#9 create wide_enrollments\n",
    "programs = programs.withColumnRenamed(\"name\",\"program_name\")\n",
    "students = students.withColumnRenamed(\"name\",\"student_name\")\n",
    "students = students.withColumnRenamed(\"_id\",\"lower_name\")\n",
    "\n",
    "combined2 = students.join(programs,students[\"program\"] == programs[\"code\"],\"inner\")\n",
    "jnenroll = combined2.join(enrollment,combined2[\"lower_name\"] == enrollment[\"student_id\"],\"inner\")\n",
    "#to avoid ambigous error:\n",
    "jnenroll = jnenroll.withColumnRenamed(\"term\",\"enroll_term\")\n",
    "jnenroll = jnenroll.withColumnRenamed(\"course\",\"enroll_course\")\n",
    "jnenroll = jnenroll.withColumnRenamed(\"section\",\"enroll_section\")\n",
    "jnenroll = jnenroll.withColumnRenamed(\"credits\",\"total_credits\")\n",
    "jnenroll.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "3fb09e52-4d9a-4cd9-8043-8502ea8832d2",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----------------+------------------+-------+---+----+-------------+--------------------+-------------------+--------------------+-------+-----------+-----------------+-------------+--------------+-----------------+-----+------------+----+------+-------+----------+--------+-------------+---------+--------+----+-------+--------------------+--------------------+---------------+----------------+-------------+--------------------+\n",
      "|       lower_name|      student_name|program|_id|code|total_credits|    elective_courses|       program_name|    required_courses|   type|enroll_term|course_enrollment|enroll_course|enroll_section|       student_id|grade|grade_points|term|course|section|enrollment|capacity|academic_year|     name|semester|year|credits|         description|elective_in_programs|key_assignments|     course_name|prerequisites|required_in_programs|\n",
      "+-----------------+------------------+-------+---+----+-------------+--------------------+-------------------+--------------------+-------+-----------+-----------------+-------------+--------------+-----------------+-----+------------+----+------+-------+----------+--------+-------------+---------+--------+----+-------+--------------------+--------------------+---------------+----------------+-------------+--------------------+\n",
      "|         abbykuss|         Abby Kuss|     DS| DS|  DS|           34|    [IST769, IST714]|       Data Science|[IST659, IST615, ...|Masters|       1231|                6|       IST722|          M001|         abbykuss|   A-|       3.667|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|amberwavesofgrain|Amber Wavesofgrain|     DS| DS|  DS|           34|    [IST769, IST714]|       Data Science|[IST659, IST615, ...|Masters|       1231|                9|       IST722|          M001|amberwavesofgrain|   A-|       3.667|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|  blanchedalmonds|  Blanche Dalmonds|     DS| DS|  DS|           34|    [IST769, IST714]|       Data Science|[IST659, IST615, ...|Masters|       1231|                3|       IST722|          M001|  blanchedalmonds|    A|         4.0|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|      chaselounge|      Chase Lounge|     DS| DS|  DS|           34|    [IST769, IST714]|       Data Science|[IST659, IST615, ...|Masters|       1231|               22|       IST722|          M001|      chaselounge|    A|         4.0|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|   dustindewinned|   Dustin DeWinned|     DS| DS|  DS|           34|    [IST769, IST714]|       Data Science|[IST659, IST615, ...|Masters|       1231|               21|       IST722|          M001|   dustindewinned|    A|         4.0|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|           ianewe|           Ian Ewe|     DS| DS|  DS|           34|    [IST769, IST714]|       Data Science|[IST659, IST615, ...|Masters|       1231|               11|       IST722|          M001|           ianewe|   B+|       3.333|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|         joyfulle|         Joy Fulle|     DS| DS|  DS|           34|    [IST769, IST714]|       Data Science|[IST659, IST615, ...|Masters|       1231|                1|       IST722|          M001|         joyfulle|    A|         4.0|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|         kurttain|         Kurt Tain|     DS| DS|  DS|           34|    [IST769, IST714]|       Data Science|[IST659, IST615, ...|Masters|       1231|               17|       IST722|          M001|         kurttain|    C|         2.0|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|         maximumm|         Max Imumm|     DS| DS|  DS|           34|    [IST769, IST714]|       Data Science|[IST659, IST615, ...|Masters|       1231|                8|       IST722|          M001|         maximumm|    A|         4.0|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|      mistyshores|      Misty Shores|     DS| DS|  DS|           34|    [IST769, IST714]|       Data Science|[IST659, IST615, ...|Masters|       1231|                7|       IST722|          M001|      mistyshores|    A|         4.0|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|       sherrywyne|       Sherry Wyne|     DS| DS|  DS|           34|    [IST769, IST714]|       Data Science|[IST659, IST615, ...|Masters|       1231|               19|       IST722|          M001|       sherrywyne|   B-|       2.667|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|     sherylmytoyz|     Sheryl Mytoyz|     DS| DS|  DS|           34|    [IST769, IST714]|       Data Science|[IST659, IST615, ...|Masters|       1231|               23|       IST722|          M001|     sherylmytoyz|    A|         4.0|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|         theodoor|         Theo Door|     DS| DS|  DS|           34|    [IST769, IST714]|       Data Science|[IST659, IST615, ...|Masters|       1231|               16|       IST722|          M001|         theodoor|   B+|       3.333|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|      tuckandroll|      Tuck Androll|     DS| DS|  DS|           34|    [IST769, IST714]|       Data Science|[IST659, IST615, ...|Masters|       1231|                5|       IST722|          M001|      tuckandroll|    B|         3.0|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|     carriemeehom|     Carrie Meehom|     IS| IS|  IS|           36|[IST722, IST714, ...|Information Systems|[IST659, IST615, ...|Masters|       1231|               18|       IST722|          M001|     carriemeehom|   B+|       3.333|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|        euronfyre|        Euron Fyre|     IS| IS|  IS|           36|[IST722, IST714, ...|Information Systems|[IST659, IST615, ...|Masters|       1231|                2|       IST722|          M001|        euronfyre|    A|         4.0|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|        frankklee|        Frank Klee|     IS| IS|  IS|           36|[IST722, IST714, ...|Information Systems|[IST659, IST615, ...|Masters|       1231|               20|       IST722|          M001|        frankklee|    A|         4.0|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|        hazeleyes|        Hazel Eyes|     IS| IS|  IS|           36|[IST722, IST714, ...|Information Systems|[IST659, IST615, ...|Masters|       1231|               14|       IST722|          M001|        hazeleyes|    A|         4.0|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|     holdenstrong|     Holden Strong|     IS| IS|  IS|           36|[IST722, IST714, ...|Information Systems|[IST659, IST615, ...|Masters|       1231|               12|       IST722|          M001|     holdenstrong|    A|         4.0|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "|       hughjapple|       Hugh Japple|     IS| IS|  IS|           36|[IST722, IST714, ...|Information Systems|[IST659, IST615, ...|Masters|       1231|               15|       IST722|          M001|       hughjapple|    A|         4.0|1231|IST722|   M001|        23|      28|    2022-2023|Fall 2022|    Fall|2022|      3|Introduction to c...|                [IS]|[project, exam]|Data Warehousing|     [IST659]|                  []|\n",
      "+-----------------+------------------+-------+---+----+-------------+--------------------+-------------------+--------------------+-------+-----------+-----------------+-------------+--------------+-----------------+-----+------------+----+------+-------+----------+--------+-------------+---------+--------+----+-------+--------------------+--------------------+---------------+----------------+-------------+--------------------+\n",
      "only showing top 20 rows\n",
      "\n"
     ]
    }
   ],
   "source": [
    "enrollments = jnenroll.join(section,(jnenroll[\"enroll_term\"] == section[\"term\"]) & \\\n",
    "                            (jnenroll[\"enroll_course\"] == section[\"course\"]) & \\\n",
    "                            (jnenroll[\"enroll_section\"] == section[\"section\"]),\"inner\")\n",
    "\n",
    "enrollments.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "64550f73-1685-43d5-bac4-fb5fe7c8a73f",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    },
    {
     "data": {
      "text/plain": [
       "743"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "enrollments.count()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dae284c8-096a-4987-98cf-0800cedced12",
   "metadata": {},
   "source": [
    "### Question 10\n",
    "\n",
    "Load the data frame you created in question 8 into `elasticsearch`, under the index `enrollments`. This time, just Omit all array types to make the problem simpler (`elective_courses`, `key_assignments`, `course_prerequisites`, etc...)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "3a42dedc-62c4-4b83-b431-2a3474834901",
   "metadata": {},
   "outputs": [],
   "source": [
    "#10 wide_enrollments to elastic search\n",
    "enrollments=enrollments.drop(\"elective_courses\", \"required_courses\",\"elective_in_programs\",\"key_assignments\",\"prerequisites\",\"required_in_programs\")\n",
    "enrollments = enrollments.select ('lower_name',\n",
    " 'student_name',\n",
    " 'program',\n",
    " 'total_credits',\n",
    " 'program_name',\n",
    " 'type',\n",
    " 'enroll_term',\n",
    " 'course_enrollment',\n",
    " 'enroll_course',\n",
    " 'enroll_section',\n",
    " 'student_id',\n",
    " 'grade',\n",
    " 'grade_points',\n",
    " 'term',\n",
    " 'course',\n",
    " 'section',\n",
    " 'enrollment',\n",
    " 'capacity',\n",
    " 'academic_year',\n",
    " 'name',\n",
    " 'semester',\n",
    " 'year',\n",
    " 'credits',\n",
    " 'description',\n",
    " 'course_name')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "5b67c44a-bd9a-4ddf-bb30-d8c6660131e5",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    }
   ],
   "source": [
    "enrollments.write.mode(\"Overwrite\").format(\"es\").save(\"enrollments/_doc\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "753ff6c9-1624-469c-9408-b9ea735493d2",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Cassandra"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "0061952d-e4ff-485c-9088-e3e112e2fddd",
   "metadata": {},
   "outputs": [],
   "source": [
    "!pip install -q cassandra-driver\n",
    "    \n",
    "from cassandra.cluster import Cluster\n",
    "with Cluster([cassandra_host]) as cluster:\n",
    "    session = cluster.connect()\n",
    "    session.execute(\"CREATE KEYSPACE IF NOT EXISTS ischooldb WITH replication={ 'class': 'SimpleStrategy', 'replication_factor' : 1 };\")\n",
    "    table = '''\n",
    "    CREATE TABLE IF NOT EXISTS ischooldb.enrollments (\n",
    "    lower_name TEXT,\n",
    "    student_name TEXT,\n",
    "    program TEXT,\n",
    "    total_credits INT,\n",
    "    program_name TEXT,\n",
    "    type TEXT,\n",
    "    enroll_term INT,\n",
    "    course_enrollment INT,\n",
    "    enroll_course TEXT,\n",
    "    enroll_section TEXT,\n",
    "    student_id TEXT,\n",
    "    grade TEXT,\n",
    "    grade_points DOUBLE,\n",
    "    term INT,\n",
    "    course TEXT,\n",
    "    section TEXT,\n",
    "    enrollment INT,\n",
    "    capacity INT,\n",
    "    academic_year TEXT,\n",
    "    name TEXT,\n",
    "    semester TEXT,\n",
    "    year INT,\n",
    "    credits INT,\n",
    "    description TEXT,\n",
    "    course_name TEXT,\n",
    "    PRIMARY KEY((lower_name, term),section));\n",
    "    '''\n",
    "    session.execute(table)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "cc20efbd-bff2-4fdb-a8d4-655cb12a53ec",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    }
   ],
   "source": [
    "enrollments.write.format(\"org.apache.spark.sql.cassandra\")\\\n",
    "  .mode(\"Append\")\\\n",
    "  .option(\"table\", \"enrollments\")\\\n",
    "  .option(\"keyspace\", \"ischooldb\")\\\n",
    "  .save()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "40baf832-3a14-45c9-9594-d607439b845a",
   "metadata": {},
   "source": [
    "### Question 11\n",
    "\n",
    "Write spark to clear the `neo4j` database of all nodes and relationships.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "bd7a903e-789b-4b01-8501-6041190b50c4",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    }
   ],
   "source": [
    "#11 reset neo4j database \n",
    "\n",
    "cipher_ql = '''\n",
    "MATCH (n)\n",
    "DETACH DELETE n\n",
    "'''\n",
    "df = spark.createDataFrame(data = [{'row':1}])\n",
    "df.write.format(\"org.neo4j.spark.DataSource\").mode(\"Overwrite\") \\\n",
    "  .option(\"url\", bolt_url) \\\n",
    "  .option(\"query\",cipher_ql) \\\n",
    "  .save()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b6910199-edde-418d-b6fa-06c5d810ce3d",
   "metadata": {},
   "source": [
    "### Question 12\n",
    "\n",
    "Load the `courses` and `program` data into `neo4j` as nodes. Exclude the `requirements`, `electives` and `prerequisites` from the node attributes. Demonstrate the data in `neo4j` by querying back it using one or more Cypher queries. NOTE: the Neo4J `name` attribute is what will display on the node bubbles."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "71eeb25c-fa18-4702-9595-34f443aca315",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Courses...\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    }
   ],
   "source": [
    "#12a load courses into Neo4j\n",
    "print(\"Courses...\")\n",
    "\n",
    "cipher_ql = \"Merge (c:Courses {code: event.code ,credits : event.credits ,description : event.description ,\\\n",
    "key_assignments: event.key_assignments , course_name : event.course_name})\"\n",
    "\n",
    "x = courses.select(\"code\",\"credits\",\"description\",\"key_assignments\",\"course_name\").distinct()\n",
    "x.write.format(\"org.neo4j.spark.DataSource\").mode(\"Overwrite\") \\\n",
    "  .option(\"url\", bolt_url) \\\n",
    "  .option(\"query\",cipher_ql) \\\n",
    "  .save()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "1b4356a4-2c1b-46f0-9bf0-24519e4d11d2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+------+-------+--------------------+----------------+--------------------+\n",
      "|  code|credits|         description| key_assignments|         course_name|\n",
      "+------+-------+--------------------+----------------+--------------------+\n",
      "|IST718|      3|A broad introduct...|       [project]|  Big Data Analytics|\n",
      "|IST722|      3|Introduction to c...| [project, exam]|    Data Warehousing|\n",
      "|IST659|      3|Definition, devel...|       [project]|Data Administrati...|\n",
      "|IST769|      3|Analyze relationa...| [project, exam]|Advanced Big Data...|\n",
      "|IST621|      3|Information and t...|         [paper]|Information Manag...|\n",
      "|IST707|      3|General overview ...|          [exam]|Applied Machine L...|\n",
      "|IST714|      3|Advanced, lab-bas...|       [project]|  Cloud Architecture|\n",
      "|IST615|      3|Cloud services cr...|[project, paper]|    Cloud Management|\n",
      "|IST687|      3|Introduces inform...| [project, exam]|Introduction to D...|\n",
      "+------+-------+--------------------+----------------+--------------------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "query = '''\n",
    "MATCH (c:Courses)\n",
    "RETURN c.code AS code, c.credits AS credits, c.description AS description, c.key_assignments AS key_assignments, c.course_name as course_name\n",
    "'''\n",
    "q12a = spark.read.format(\"org.neo4j.spark.DataSource\") \\\n",
    "                          .option(\"url\", bolt_url) \\\n",
    "                          .option(\"query\",query) \\\n",
    "                          .load()\n",
    "q12a.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "69aa723b-5479-4232-aca3-0197e199cc82",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Programs...\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    }
   ],
   "source": [
    "#12b load programs into neo4j\n",
    "print(\"Programs...\")\n",
    "cipher_ql_p = '''\n",
    "MERGE (p:Programs {code: event.code, credits: event.credits,program_name: event.program_name, type: event.type})\n",
    "'''\n",
    "\n",
    "y = programs.select(\"code\",\"credits\",\"program_name\",\"type\").distinct()\n",
    "y.write.format(\"org.neo4j.spark.DataSource\").mode(\"Overwrite\") \\\n",
    "  .option(\"url\", bolt_url) \\\n",
    "  .option(\"query\",cipher_ql_p) \\\n",
    "  .save()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "ef36d627-b130-4bd7-879a-c3c04c33dc17",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+----+-------+--------------------+-----------+\n",
      "|code|credits|        program_name|       type|\n",
      "+----+-------+--------------------+-----------+\n",
      "|  DS|     34|        Data Science|    Masters|\n",
      "| BDC|      9|Data Engineering ...|Certificate|\n",
      "| MLC|      9|Machine Learning ...|Certificate|\n",
      "| CCC|      9|Cloud Computing C...|Certificate|\n",
      "|  IS|     36| Information Systems|    Masters|\n",
      "+----+-------+--------------------+-----------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "query = '''\n",
    "MATCH (p:Programs)\n",
    "RETURN p.code AS code, p.credits AS credits, p.program_name AS program_name, p.type AS type\n",
    "'''\n",
    "q12b = spark.read.format(\"org.neo4j.spark.DataSource\") \\\n",
    "                          .option(\"url\", bolt_url) \\\n",
    "                          .option(\"query\",query) \\\n",
    "                          .load()\n",
    "q12b.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "6c0ec1f0-02ad-4e08-b99f-2072eb2ed8b1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['_id',\n",
       " 'code',\n",
       " 'credits',\n",
       " 'elective_courses',\n",
       " 'program_name',\n",
       " 'required_courses',\n",
       " 'type']"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "programs.columns"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a5508275-5202-43f5-8adf-773dc22fc681",
   "metadata": {},
   "source": [
    "### Question 13\n",
    "\n",
    "Load the `requirements` and `electives` data into `neo4j` as relationships to the nodes you created in Question 12. Use the `program` data to form the `required` and `elective` course relationships. Demonstrate the relationships in `neo4j` are present by querying back it using one or more Cypher queries."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "7f782d89-fa86-4c79-b1f0-baf383c47100",
   "metadata": {},
   "outputs": [],
   "source": [
    "#13a program course requirements\n",
    "\n",
    "cipher_ql = \"\"\"\n",
    "MATCH (p:Programs {code: event.code})\n",
    "UNWIND event.required_courses AS required_courses\n",
    "MATCH (c:Courses {code: required_courses})\n",
    "MERGE (p)-[:Requires {course: required_courses} ]->(c)\n",
    "\"\"\"\n",
    "\n",
    "programs.write.format(\"org.neo4j.spark.DataSource\").mode(\"Overwrite\") \\\n",
    "  .option(\"url\", bolt_url) \\\n",
    "  .option(\"query\",cipher_ql) \\\n",
    "  .save()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "c23788c0-afeb-493c-9dc3-580d8286a68e",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "                                                                                \r"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----------+--------------------+\n",
      "|ProgramCode|     RequiredCourses|\n",
      "+-----------+--------------------+\n",
      "|         DS|[IST718, IST659, ...|\n",
      "|        MLC|[IST718, IST707, ...|\n",
      "|        BDC|[IST722, IST659, ...|\n",
      "|         IS|[IST659, IST621, ...|\n",
      "|        CCC|[IST621, IST714, ...|\n",
      "+-----------+--------------------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "query = '''\n",
    "MATCH (p:Programs)-[r:Requires]->(c:Courses)\n",
    "RETURN p.code AS ProgramCode, collect(c.code) AS RequiredCourses\n",
    "'''\n",
    "q13a = spark.read.format(\"org.neo4j.spark.DataSource\") \\\n",
    "                          .option(\"url\", bolt_url) \\\n",
    "                          .option(\"query\",query) \\\n",
    "                          .load()\n",
    "q13a.show()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "9abc97bf-a75a-48d9-902a-aae259211e79",
   "metadata": {},
   "outputs": [],
   "source": [
    "#13b program course electives\n",
    "\n",
    "cipher_ql = \"\"\"\n",
    "MATCH (p:Programs {code: event.code})\n",
    "UNWIND event.elective_courses AS elective_courses\n",
    "MATCH (c:Courses {code: elective_courses})\n",
    "MERGE (p)-[:elective {course: elective_courses} ]->(c)\n",
    "\"\"\"\n",
    "\n",
    "programs.write.format(\"org.neo4j.spark.DataSource\").mode(\"Overwrite\") \\\n",
    "  .option(\"url\", bolt_url) \\\n",
    "  .option(\"query\",cipher_ql) \\\n",
    "  .save()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "68aa9747-57f5-4387-88ab-aa6ecbf04ba1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+-----------+--------------------+\n",
      "|ProgramCode|     ElectiveCourses|\n",
      "+-----------+--------------------+\n",
      "|         IS|[IST722, IST714, ...|\n",
      "|         DS|    [IST769, IST714]|\n",
      "+-----------+--------------------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "query = '''\n",
    "MATCH (p:Programs)-[e:elective]->(c:Courses)\n",
    "RETURN p.code AS ProgramCode, collect(c.code) AS ElectiveCourses\n",
    "'''\n",
    "q13b = spark.read.format(\"org.neo4j.spark.DataSource\") \\\n",
    "                          .option(\"url\", bolt_url) \\\n",
    "                          .option(\"query\",query) \\\n",
    "                          .load()\n",
    "q13b.show()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "04ad62a7-505a-4bb8-a2bd-3756cf6719d5",
   "metadata": {},
   "source": [
    "### Question 14\n",
    "\n",
    "Load the `prerequisites` into `neo4j` as relationships to the `course` nodes you created in Question 12. Demonstrate the relationships in `neo4j` are present by querying back it using one or more Cypher queries."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "1b9e586b-c5be-4908-bc31-26ab6ef5ba9b",
   "metadata": {},
   "outputs": [],
   "source": [
    "cipher_ql = \"\"\"\n",
    "MATCH (c:Courses {code: event.code})\n",
    "UNWIND event.prerequisites AS prerequisites\n",
    "MATCH (n:Courses {code: prerequisites})\n",
    "MERGE (c)-[:prerequisites {course: prerequisites} ]->(n)\n",
    "\"\"\"\n",
    "\n",
    "courses.write.format(\"org.neo4j.spark.DataSource\").mode(\"Overwrite\") \\\n",
    "  .option(\"url\", bolt_url) \\\n",
    "  .option(\"query\",cipher_ql) \\\n",
    "  .save()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "5fe167d7-cd63-4a05-aeef-800511950603",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+----------+-------------+\n",
      "|CourseCode|Prerequisites|\n",
      "+----------+-------------+\n",
      "|    IST722|     [IST659]|\n",
      "|    IST769|     [IST659]|\n",
      "|    IST714|     [IST615]|\n",
      "|    IST707|     [IST687]|\n",
      "|    IST718|     [IST687]|\n",
      "+----------+-------------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "query = '''\n",
    "MATCH (c:Courses)-[r:prerequisites]->(n:Courses)\n",
    "RETURN c.code AS CourseCode, collect(n.code) AS Prerequisites\n",
    "'''\n",
    "q14 = spark.read.format(\"org.neo4j.spark.DataSource\") \\\n",
    "                          .option(\"url\", bolt_url) \\\n",
    "                          .option(\"query\",query) \\\n",
    "                          .load()\n",
    "q14.show()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f1c4d61d-5076-4d6e-9f54-03e437d18333",
   "metadata": {},
   "source": [
    "### Question 15\n",
    "\n",
    "Write a Cypher query to display courses which are required by both the `IS` and `DS` programs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "2252e315-eaba-47ee-9f8e-11fc43529c5b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+---------+--------------------+--------------+--------------------+\n",
      "|course_id|         course_name|course_credits|  course_description|\n",
      "+---------+--------------------+--------------+--------------------+\n",
      "|   IST615|    Cloud Management|             3|Cloud services cr...|\n",
      "|   IST659|Data Administrati...|             3|Definition, devel...|\n",
      "+---------+--------------------+--------------+--------------------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "#15 Cypher query courses required in DS and IS\n",
    "\n",
    "query = '''\n",
    "MATCH (is:Programs {code: \"IS\"})-[:Requires]->(c:Courses)<-[:Requires]-(ds:Programs {code: \"DS\"})\n",
    "RETURN c.code as course_id,c.course_name as course_name,c.credits as course_credits,c.description as course_description\n",
    "'''\n",
    "q15 = spark.read.format(\"org.neo4j.spark.DataSource\") \\\n",
    "                          .option(\"url\", bolt_url) \\\n",
    "                          .option(\"query\",query) \\\n",
    "                          .load()\n",
    "q15.show()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3bbe6590-97e2-477f-b860-7ffd5fe63640",
   "metadata": {},
   "source": [
    "### Question 16\n",
    "\n",
    "Write a Cypher query to retrieve the `course code`, `course title`, and the count of programs the course is a requirement in. Write as a Cypher query but retrieve the  output as a Spark Dataframe."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "7b68985d-c57c-42b3-87a5-4b9c4b6114f7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "+----------+--------------------+------------+\n",
      "|CourseCode|         CourseTitle|ProgramCount|\n",
      "+----------+--------------------+------------+\n",
      "|    IST718|  Big Data Analytics|           2|\n",
      "|    IST722|    Data Warehousing|           1|\n",
      "|    IST659|Data Administrati...|           3|\n",
      "|    IST769|Advanced Big Data...|           1|\n",
      "|    IST621|Information Manag...|           2|\n",
      "|    IST707|Applied Machine L...|           2|\n",
      "|    IST714|  Cloud Architecture|           1|\n",
      "|    IST615|    Cloud Management|           3|\n",
      "|    IST687|Introduction to D...|           2|\n",
      "+----------+--------------------+------------+\n",
      "\n"
     ]
    }
   ],
   "source": [
    "#16 Cypher to spark table\n",
    "\n",
    "query_t = '''\n",
    "MATCH (p:Programs)-[:Requires]->(c:Courses)\n",
    "RETURN c.code AS CourseCode, c.course_name AS CourseTitle, count(p) AS ProgramCount\n",
    "'''\n",
    "q16 = spark.read.format(\"org.neo4j.spark.DataSource\") \\\n",
    "                          .option(\"url\", bolt_url) \\\n",
    "                          .option(\"query\",query_t) \\\n",
    "                          .load()\n",
    "q16.show()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "172bc633",
   "metadata": {},
   "source": [
    "### Questions 17,18,19 and 20\n",
    "\n",
    "These are not spark questions as they use kibana."
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
